Repository: 52000680student/mobile_app
Catalog: lib/l10n/app_*.arb
Languages: vi

# appName
source: Sample collection at home
vi: Thu thập mẫu tại nhà

source: Hello
vi: Xin chào

source: Welcome
vi: Chào mừng

source: Error
vi: Lỗi

# networkError
source: Network error occurred
vi: Đã xảy ra lỗi mạng

# unknownError
source: An unknown error occurred
vi: Đã xảy ra lỗi không xác định

source: Retry
vi: Thử lại

source: Cancel
vi: Hủy

source: Confirm
vi: Xác nhận

source: Loading...
vi: Đang tải...

source: Login
vi: Đăng nhập

source: Logout
vi: Đăng xuất

source: Username
vi: Tên đăng nhập

source: Password
vi: Mật khẩu

# usernameHint
source: Enter username
vi: Nhập tên đăng nhập

# passwordHint
source: Enter password
vi: Nhập mật khẩu

source: Remember me
vi: Ghi nhớ đăng nhập

source: Welcome Back!
vi: Chào mừng trở lại!

source: Sign in to continue.
vi: Đăng nhập để tiếp tục.

# usernameRequired
source: Username is required
vi: Tên đăng nhập là bắt buộc

# passwordRequired
source: Password is required
vi: Mật khẩu là bắt buộc

# passwordTooShort
source: Password must be at least {minLength} characters
vi: Mật khẩu phải có ít nhất {minLength} ký tự

# invalidCredentials
source: Invalid username or password
vi: Tên đăng nhập hoặc mật khẩu không hợp lệ

# loginFailed
source: Login failed. Please try again.
vi: Đăng nhập thất bại. Vui lòng thử lại.

source: Home
vi: Trang chủ

# logoutConfirmTitle
source: Logout
vi: Đăng xuất

# logoutConfirmMessage
source: Are you sure you want to logout?
vi: Bạn có chắc chắn muốn đăng xuất?

# loginSuccessful
source: You have successfully logged in to your account.
vi: Bạn đã đăng nhập thành công vào tài khoản của mình.

source: Dashboard
vi: Bảng điều khiển

source: Profile
vi: Hồ sơ

source: Settings
vi: Cài đặt

# dashboardDescription
source: View your personalized dashboard
vi: Xem bảng điều khiển cá nhân của bạn

# profileDescription
source: Manage your profile information
vi: Quản lý thông tin hồ sơ của bạn

# settingsDescription
source: Configure your app preferences
vi: Cấu hình tùy chọn ứng dụng của bạn

source: Feature coming soon!
vi: Tính năng sắp ra mắt!

source: Patient Admissions
vi: Tiếp nhận bệnh nhân

source: Manual Services
vi: Dịch vụ thủ công

source: Waiting for admission
vi: Chờ lấy mẫu

source: Sample taken
vi: Đã lấy mẫu

source: All departments
vi: Tất cả khoa

source: Internal Medicine
vi: Khoa Nội

source: Surgery
vi: Khoa Ngoại

source: Obstetrics
vi: Khoa Sản

source: Pediatrics
vi: Khoa Nhi

source: Enter patient ID
vi: Nhập mã bệnh nhân

# patientCount
source: {count} patients
vi: {count} bệnh nhân

# lastUpdated
source: â€¢ Last updated
vi: • Cập nhật mới nhất

source: Birth date
vi: Ngày sinh

source: Admission date
vi: Ngày tiếp nhận

source: Gender
vi: Giới tính

source: Age
vi: Tuổi

source: Patient type
vi: Đối tượng

source: View sample
vi: Xem mẫu

source: Take sample
vi: Lấy mẫu

source: View details
vi: Xem chi tiết

source: Waiting for sample
vi: Chờ lấy mẫu

source: Sample collected
vi: Đã lấy mẫu

source: Sample Details
vi: Chi tiết mẫu

# sampleList
source: Sample list ({count} samples)
vi: Danh sách mẫu ({count} mẫu)

source: Sample
vi: Mẫu {number}

# sampleTab
source: Sample
vi: Mẫu

source: Venous blood
vi: Máu tĩnh mạch

source: Urine
vi: Nước tiểu

source: Time collected:
vi: Thời gian lấy:

source: Collected by:
vi: Người lấy:

source: Quality:
vi: Chất lượng:

source: Service:
vi: Dịch vụ:

source: Services
vi: Dịch vụ:

source: Sample type
vi: Loại mẫu:

source: Collector:
vi: Người lấy:

source: Receiver:
vi: Người nhận:

source: Collection Time:
vi: Thời gian lấy:

source: Received Time:
vi: Thời gian nhận:

source: Test Code:
vi: Mã xét nghiệm:

source: Test Name:
vi: Tên xét nghiệm:

# testDescription
source: Description:
vi: Mô tả:

source: Good
vi: Tốt

source: Comprehensive blood test
vi: Xét nghiệm máu tổng quát

source: General urine analysis
vi: Tổng phân tích nước tiểu

# patientStateDraft
source: Draft
vi: Bản nháp

# patientStateSubmitted
source: Received
vi: Đã tiếp nhận

# patientStateCanceled
source: Cancelled
vi: Đã hủy

# patientStateCollected
source: Sample taken
vi: Đã lấy mẫu

# patientStateDelivered
source: Sample delivered
vi: Đã giao mẫu

# patientStateReceived
source: Sample received
vi: Đã nhận mẫu

# patientStateOnHold
source: Pause
vi: Tạm dừng

# patientStateInProcess
source: Accumulating
vi: Đang xử lý

# patientStateCompleted
source: Results available
vi: Có kết quả

# patientStateConfirmed
source: Received
vi: Đã xác nhận

# patientStateValidated
source: Approved
vi: Đã phê duyệt

# patientStateReleased
source: Results sent
vi: Đã gửi kết quả

# patientStateSigned
source: Signed
vi: Đã ký

# patientStateApproved
source: Confirmed
vi: Đã phê duyệt

# errorNetwork
source: Network connection error
vi: Lỗi kết nối mạng

# errorServer
source: Server error occurred
vi: Đã xảy ra lỗi máy chủ

# errorTimeout
source: Request timeout
vi: Hết thời gian chờ

# errorUnauthorized
source: Unauthorized access
vi: Không có quyền truy cập

# errorForbidden
source: Access forbidden
vi: Truy cập bị cấm

# errorNotFound
source: Resource not found
vi: Không tìm thấy tài nguyên

# errorUnknown
source: An unknown error occurred
vi: Đã xảy ra lỗi không xác định

# errorFetchDepartments
source: Failed to load departments
vi: Không thể tải danh sách khoa

# errorFetchPatients
source: Failed to load patients
vi: Không thể tải danh sách bệnh nhân

# errorLoadMorePatients
source: Failed to load more patients
vi: Không thể tải thêm bệnh nhân

# errorInvalidDateRange
source: Invalid date range selected
vi: Khoảng thời gian không hợp lệ

# errorNoData
source: No data available
vi: Không có dữ liệu

# errorEmptySearch
source: Please enter search criteria
vi: Vui lòng nhập tiêu chí tìm kiếm

source: From date
vi: Từ ngày

source: To date
vi: Đến ngày

source: Loading more...
vi: Đang tải thêm...

# errorOccurred
source: An error occurred
vi: Có lỗi xảy ra

# emptyStateGuidance
source: Try changing filters or pull down to refresh
vi: Hãy thử thay đổi bộ lọc hoặc kéo xuống để làm mới

# noWaitingPatients
source: No patients waiting for admission
vi: Không có bệnh nhân chờ lấy mẫu

# noSampleTakenPatients
source: No patients with samples taken
vi: Không có bệnh nhân đã lấy mẫu

source: Vietnamese
vi: Tiếng Việt

source: Record Me
vi: Ghi nhận

# recordSampleConfirmTitle
source: Record Sample
vi: Ghi nhận mẫu

# recordSampleConfirmMessage
source: Are you sure you want to record this sample collection?
vi: Bạn có chắc chắn muốn ghi nhận việc lấy mẫu này không?

# recordSampleSuccess
source: Sample recorded successfully
vi: Đã ghi nhận mẫu thành công

# recordSampleError
source: Failed to record sample
vi: Không thể ghi nhận mẫu

# takeSampleConfirmTitle
source: Take All Samples
vi: Lấy Tất Cả Mẫu

# takeSampleConfirmMessage
source: Are you sure you want to take all samples for this patient?
vi: Bạn có chắc chắn muốn lấy tất cả mẫu cho bệnh nhân này không?

# takeSampleSuccess
source: All samples taken successfully
vi: Đã lấy tất cả mẫu thành công

# takeSampleError
source: Failed to take samples
vi: Không thể lấy mẫu

# sampleUpdateTimeout
source: Sample update is taking longer than expected. The update may have succeeded on the server. Please refresh to check the status.
vi: Việc cập nhật mẫu đang mất nhiều thời gian hơn dự kiến. Việc cập nhật có thể đã thành công trên máy chủ. Vui lòng làm mới để kiểm tra trạng thái.

# sampleCollectionTimeout
source: Sample collection is taking longer than expected. The operation may have succeeded on the server. Please refresh to check the status.
vi: Việc thu thập mẫu đang mất nhiều thời gian hơn dự kiến. Thao tác có thể đã thành công trên máy chủ. Vui lòng làm mới để kiểm tra trạng thái.

source: Processing...
vi: Đang xử lý...

# errorSessionExpired
source: Your session has expired. Please login again.
vi: Phiên đăng nhập của bạn đã hết hạn. Vui lòng đăng nhập lại.

# errorBadRequest
source: Bad request. Please check your input.
vi: Yêu cầu không hợp lệ. Vui lòng kiểm tra thông tin đầu vào.

# errorAccessDenied
source: Access denied. You don't have permission to perform this action.
vi: Truy cập bị từ chối. Bạn không có quyền thực hiện hành động này.

# errorTooManyRequests
source: Too many requests. Please try again later.
vi: Quá nhiều yêu cầu. Vui lòng thử lại sau.

# errorInternalServer
source: Internal server error. Please try again later.
vi: Lỗi máy chủ nội bộ. Vui lòng thử lại sau.

# errorServiceUnavailable
source: Service temporarily unavailable.
vi: Dịch vụ tạm thời không khả dụng.

# errorValidationFailed
source: Validation failed.
vi: Xác thực thất bại.

# errorRequestCancelled
source: Request was cancelled.
vi: Yêu cầu đã bị hủy.

# errorUnexpected
source: An unexpected error occurred. Please try again.
vi: Đã xảy ra lỗi không mong muốn. Vui lòng thử lại.

# errorConnectionTimeout
source: Connection timeout. Please check your internet connection.
vi: Kết nối hết thời gian chờ. Vui lòng kiểm tra kết nối internet.

# errorNetworkConnection
source: Network error. Please check your internet connection.
vi: Lỗi mạng. Vui lòng kiểm tra kết nối internet.

# errorAuthServiceError
source: Authentication service error. Please contact support.
vi: Lỗi dịch vụ xác thực. Vui lòng liên hệ hỗ trợ.

# errorInvalidRequest
source: Invalid request. Please try again.
vi: Yêu cầu không hợp lệ. Vui lòng thử lại.

# errorFailedToParseData
source: Failed to parse data
vi: Không thể phân tích dữ liệu

# errorFailedToUpdateSample
source: Failed to update sample
vi: Không thể cập nhật mẫu

# errorFailedToTakeSamples
source: Failed to take all samples
vi: Không thể lấy tất cả mẫu

# errorCacheOperation
source: Cache operation failed
vi: Thao tác bộ nhớ đệm thất bại

# errorInitializationFailed
source: Failed to initialize app
vi: Không thể khởi tạo ứng dụng

# errorInvalidUsernameOrPassword
source: Invalid username or password
vi: Tên đăng nhập hoặc mật khẩu không hợp lệ

# errorAuthenticationFailed
source: Authentication failed. Please try again.
vi: Xác thực thất bại. Vui lòng thử lại.

source: Process Management
vi: Quản lý quy trình

# manualServiceTitle
source: Manual Service
vi: Dịch vụ - Thủ công

source: Administrative Information
vi: Thông tin hành chính

source: Patient ID
vi: Mã BN

source: Full Name
vi: Họ tên

# medicalCode
source: Medical Code/HSSV Code
vi: Mã y tế/Mã HSSV

source: Insurance Number
vi: Số bảo hiểm

source: Male
vi: Nam

source: Female
vi: Nữ

source: Appointment Date
vi: Ngày chỉ định

source: Service Object
vi: Đối tượng DV

source: Date of Birth
vi: Ngày sinh

source: Doctor
vi: Bác sĩ

source: Department
vi: Khoa/Phòng

source: Phone
vi: Điện thoại

source: Address
vi: Địa chỉ

source: Notes
vi: Ghi chú

source: Diagnosis
vi: Chẩn đoán

source: Inpatient
vi: Nội trú

source: Emergency
vi: Cấp cứu

source: Select service...
vi: Chọn dịch vụ...

# selectServiceLabel
source: Select service
vi: Chọn dịch vụ

# chooseOption
source: Choose...
vi: Chọn...

# patientIdHint
source: Enter patient ID
vi: Chọn...

# fullNameHint
source: Full Name
vi: Họ tên

# medicalCodeHint
source: Medical Code
vi: Mã y tế

# insuranceNumberHint
source: Insurance Number
vi: Mã bảo hiểm

# phoneHint
source: Phone
vi: Điện thoại

# addressHint
source: Address
vi: Địa chỉ

# notesHint
source: Notes...
vi: Ghi chú...

# diagnosisHint
source: Diagnosis...
vi: Chẩn đoán...

source: Serial Number
vi: Số seri

source: Save Barcode
vi: Lưu mã vạch

source: Select All Services
vi: Chọn tất cả dịch vụ

source: Save All Barcodes
vi: Lưu tất cả mã vạch

# barcodeGenerating
source: Generating barcode...
vi: Đang tạo mã vạch...

# barcodeSavedSuccessfully
source: Barcode saved successfully to gallery
vi: Mã vạch đã được lưu thành công vào thư viện

# barcodeGenerationFailed
source: Failed to generate barcode
vi: Không thể tạo mã vạch

# barcodeSaveFailed
source: Failed to save barcode to gallery
vi: Không thể lưu mã vạch vào thư viện

# barcodePermissionDenied
source: Storage permission required to save barcode
vi: Cần quyền lưu trữ để lưu mã vạch

# barcodeNoRequestId
source: Please save the request first before generating barcodes
vi: Vui lòng lưu yêu cầu trước khi tạo mã vạch

# notAvailable
source: N/A
vi: Không có

source: Select All Samples
vi: Chọn tất cả mẫu

# selectAllSamplesDescription
source: Toggle to select or deselect all sample items
vi: Chuyển đổi để chọn hoặc bỏ chọn tất cả mẫu

source: Get All Samples
vi: Lấy tất cả mẫu

source: Sample Actions
vi: Thao tác mẫu

source: Refresh
vi: Làm mới

source: Save
vi: Lưu

source: Confirm Refresh
vi: Xác nhận làm mới

# confirmRefreshMessage
source: Are you sure you want to clear all entered data? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa tất cả dữ liệu đã nhập? Hành động này không thể hoàn tác.

# formsCleared
source: All forms have been cleared successfully
vi: Tất cả biểu mẫu đã được xóa thành công

# pleaseCompleteAllFields
source: Please complete all required fields
vi: Vui lòng điền đầy đủ các trường bắt buộc

source: Data saved successfully
vi: Dữ liệu đã được lưu thành công

# pleaseSelectPatient
source: Please select a patient
vi: Vui lòng chọn bệnh nhân

source: Administrative form not available
vi: Biểu mẫu hành chính không có sẵn

# errorPreparingRequest
source: Error preparing request: {error}
vi: Lỗi chuẩn bị yêu cầu: {error}

# requestSavedSuccessfully
source: Request saved successfully! ID: {id}
vi: Yêu cầu đã được lưu thành công!

source: Receive All Samples
vi: Nhận tất cả mẫu

# receiveUserId
source: Receive User
vi: Người nhận

source: Print
vi: In

source: Preview Barcode
vi: Xem mã vạch

source: Connection Type
vi: Loại kết nối

source: Bluetooth Devices
vi: Thiết bị Bluetooth

source: Paired Devices
vi: Thiết bị đã kết nối

source: Discover Devices
vi: Tìm thiết bị

source: Discovering...
vi: Đang tìm thiết bị...

source: No devices found
vi: Không tìm thấy thiết bị

# bluetoothDisabled
source: Bluetooth is disabled. Please enable Bluetooth to continue.
vi: Bluetooth đã bị tắt. Vui lòng bật Bluetooth để tiếp tục.

# bluetoothNotSupported
source: Bluetooth is not supported on this device
vi: Bluetooth không được hỗ trợ trên thiết bị này

# bluetoothPermissionRequired
source: Bluetooth permissions are required to scan for devices
vi: Quyền truy cập Bluetooth là bắt buộc để quét thiết bị

source: Enable Permissions
vi: Cho phép truy cập Bluetooth

source: Paired
vi: Đã kết nối

source: Unpaired
vi: Chưa kết nối

source: Select Bluetooth Device
vi: Chọn thiết bị Bluetooth

# bluetoothConnectionFailed
source: Failed to connect to Bluetooth device
vi: Không thể kết nối với thiết bị Bluetooth

# bluetoothConnectionError
source: Error connecting to Bluetooth device
vi: Lỗi kết nối với thiết bị Bluetooth
